block_enter_text = "Приветствуем! На связи бот Студсовета Питерской Вышки. Чем могу помочь сегодня?"
block_default_text = "Вы хотите создать обращение (нам будет проще решить вопрос если вы сначала выберите категорию)?"
unknown_action_text = "К сожалению, я не знаю что делать с этим сообщением. Попробуйте выбрать один из пунктов меню."

reqest_registred_text = "Обращение зарегистрировано. Спасибо за обращение!"

button_option_request = "Написать обращение"
button_option_info = "Узнать информацию про нас"
button_option_work = "Хочу работать с вами"

button_option_request_alt = "Выбрать категорию обращения"

unknown_user = "Errror: user is unknown"
