block_enter_text = "Студенческий совет НИУ ВШЭ – Санкт-Петербург — выборный представительный орган НИУ ВШЭ – Санкт-Петербург. Основная наша задача — представление и отстаивание интересов студентов НИУ ВШЭ – Санкт-Петербург на всех уровнях.\n\nВ компетенцию Студсовета входит рассмотрение, формирование мнения и рекомендаций по всем вопросам, затрагивающим права и законные интересы студентов (повышенные стипендии, общежития, образовательный процесс и т.д.)"

links_text = "Наш сайт: https://spb.hse.ru/studsovet/\nНаш ВК: https://vk.com/hsespbstudcouncil"

members_text = "Текущий состав:\n\n"\
               "Председатель - <a href=\"https://vk.com/lrsbog\">Богосьян Лариса Мироновна</a> (4 курс, «Социология и социальная информатика»)\n"\
               "Секретарь - <a href=\"https://vk.com/ekatia17\">Саранская Екатерина</a> (3 курс, «Юриспруденция»)\n\n"\
               "IT-инфраструктура - <a href=\"https://vk.com/setday\">Серков Александр Максимович</a> (2 курс, «Прикладной анализ данных и искусственный интеллект»)\n"\
               "Медиа-комитет - <a href=\"https://vk.com/asterlissa\">Астафьева Елизавета Денисовна</a> (3 курс, «Филология»)\n"\
               "..."
               

button_option_members = "Состав"
button_option_links = "Ссылки"
