block_enter_text : dict[str, str] = {
    "ru": "Студенческий совет НИУ ВШЭ – Санкт-Петербург — выборный представительный орган НИУ ВШЭ – Санкт-Петербург. Основная наша задача — представление и отстаивание интересов студентов НИУ ВШЭ – Санкт-Петербург на всех уровнях.\n\nВ компетенцию Студсовета входит рассмотрение, формирование мнения и рекомендаций по всем вопросам, затрагивающим права и законные интересы студентов (повышенные стипендии, общежития, образовательный процесс и т.д.)",
    "en": "The Student Council of HSE University - St. Petersburg is an elected representative body of HSE University - St. Petersburg. Our main task is to represent and defend the interests of students of HSE University - St. Petersburg at all levels.\n\nThe competence of the Student Council includes consideration, formation of opinions and recommendations on all issues affecting the rights and legitimate interests of students (increased scholarships, dormitories, educational process, etc.)",
}

links_text : dict[str, str] = {
    "ru": "Наш сайт: https://spb.hse.ru/studsovet/\n\nНаш ВК: https://vk.com/hsespbstudcouncil\nИ наш тг-канал: https://t.me/studcouncil",
    "en": "Our website: https://spb.hse.ru/studsovet/\n\nOur VK: https://vk.com/hsespbstudcouncil\nAnd our tg-channel: https://t.me/studcouncil",
}

# member_data_list = [
#     ["Богосьян Лариса Мироновна", "https://vk.com/lrsbog", "https://t.me/lrbog", "4 курс, «Социология и социальная информатика»", "Председатель"],
#     ["Саранская Екатерина", "https://vk.com/ekatia17", "https://t.me/ekatia17", "3 курс, «Юриспруденция»", "Секретарь"],
#     ["Серков Александр Максимович", "https://vk.com/setday", "https://t.me/", "2 курс, «Прикладной анализ данных и искусственный интеллект»", "IT-инфраструктура"],
#     ["Горшков Максим Викторович", "https://vk.com/flihten", "https://t.me/KiJhoTo", "2 курс, «Политология и мировая политика»", "Глава комитета Event-менеджмента и PR"],
#     ["Архипов Данил Владимирович", "https://vk.com/capnsoth", "https://t.me/CapnSoth", "2 курс, «Юриспруденция»", "Глава HR-комитет"],
#     ["Козин Георгий Евгеньевич", "https://vk.com/waitforit", "https://t.me/Wait_For_lt", "2 курс, «Международный бакалавриат по экономике и бизнесу»", "Глава Научного отдела"],
#     ["Астафьева Елизавета Денисовна", "https://vk.com/asterlissa", "https://t.me/lizastaf", "3 курс, «Филология»", "Глава Медиа-комитета"],
#     ["Бахвалова Анита Николаевна", "https://vk.com/abnnow", "https://t.me/anita_bn03", "4 курс, «Управление и аналитика в государственном секторе»", "Глава SMM-комитета"],
#     ["Сударева Екатерина Михайловна", "https://vk.com/kattyayaa", "https://t.me/kattyyaaa", "1 курс, «Медиакоммуникации»", "Дизайнер SMM-комитета"],
#     ["Дмитриева Ксения Дмитриевна", "https://vk.com/queen_cordelia", "https://t.me/Ksenia_26", "3 курс, «Международный бакалавриат»", "Руководитель команды продвижения"],
#     ["Пшеничникова Анастасия Сергеевна", "https://vk.com/anastasiapsh", "https://t.me/you_no_you", "4 курс, «Социология и социальная информатика»", "Руководитель отдела по партнерским связям"],
#     ["Вавилов Вячеслав Леонидович", "https://vk.com/vvavilov04", "https://t.me/VaviLove14", "3 курс, «Политология»", "Делегат"],
#     ["Филиппова София Денисовна", "https://vk.com/filizhopss", "https://t.me/filizhops", "4 курс, «Юриспруденция»", "И.О. Председателя | Глава Правового комитета"],
#     ["Девицкий Иван Михайлович", "https://vk.com/i.devitsky", "https://t.me/Ivatalks", "4 курс, «Юриспруденция»", "Глава Социального комитета"],
#     ["Бекетова Софья Александровна", "https://vk.com/mirrrroh", "https://t.me/mirrr0h", "3 курс, «Дизайн»", "Делегат"],
#     ["Слинкина Екатерина Алексеевна", "https://vk.com/katie_sss", "https://t.me/katie_sss", "3 курс, «Востоковедение»", "Делегат"],
# ]

headmaster_member_data_list = [
    ["Филиппова София", "https://vk.com/filizhopss", "https://t.me/filizhops", "«Юриспруденция»", "И.О. Председателя | Глава Правового комитета"],
    ["Богосьян Лариса", "https://vk.com/lrsbog", "https://t.me/lrbog", "«Социология и социальная информатика»", "Бывший председатель"],
    ["Саранская Екатерина", "https://vk.com/ekatia17", "https://t.me/ekatia17", "«Юриспруденция»", "Секретарь"],
]

head_member_data_list = [
    ["Горшков Максим", "https://vk.com/flihten", "https://t.me/KiJhoTo", "«Политология и мировая политика»", "Глава комитета Event-менеджмента и PR"],
    ["Архипов Данил", "https://vk.com/capnsoth", "https://t.me/CapnSoth", "«Юриспруденция»", "Глава HR-комитет"],
    ["Астафьева Елизавета", "https://vk.com/asterlissa", "https://t.me/lizastaf", "«Филология»", "Глава Медиа-комитета"],
    ["Бахвалова Анита", "https://vk.com/abnnow", "https://t.me/anita_bn03", "«Управление и аналитика в государственном секторе»", "Глава SMM-комитета"],
    ["Девицкий Иван", "https://vk.com/i.devitsky", "https://t.me/Ivatalks", "«Юриспруденция»", "Глава Социального комитета"],
]

other_member_data_list = [
    ["Козин Георгий", "https://vk.com/waitforit", "https://t.me/Wait_For_lt", "«Международный бакалавриат по экономике и бизнесу»", "Руководитель Научного отдела"],
    ["Дмитриева Ксения", "https://vk.com/queen_cordelia", "https://t.me/Ksenia_26", "«Международный бакалавриат»", "Руководитель команды продвижения"],
    ["Пшеничникова Анастасия", "https://vk.com/anastasiapsh", "https://t.me/you_no_you", "«Социология и социальная информатика»", "Руководитель отдела по партнерским связям"],
    ["Серков Александр", "https://vk.com/setday", "https://t.me/", "«Прикладной анализ данных и искусственный интеллект»", "IT-инфраструктура"],
    ["Сударева Екатерина", "https://vk.com/kattyayaa", "https://t.me/kattyyaaa", "«Медиакоммуникации»", "Дизайнер SMM-комитета"],
    ["Бекетова Софья", "https://vk.com/mirrrroh", "https://t.me/mirrr0h", "«Дизайн»", "Делегат"],
    ["Слинкина Екатерина", "https://vk.com/katie_sss", "https://t.me/katie_sss", "«Востоковедение»", "Делегат"],
    ["Вавилов Вячеслав", "https://vk.com/vvavilov04", "https://t.me/VaviLove14", "«Политология»", "Делегат"],
]

members_text = "".join([
    "Текущий состав:\n\n",
    *[f'= {member[4]} - <a href="{member[1]}">{member[0]}</a> ({member[3]})\n' for member in headmaster_member_data_list],
    "\n",
    *[f'= {member[4]} - <a href="{member[1]}">{member[0]}</a> ({member[3]})\n' for member in head_member_data_list],
    "\n",
    *[f'= {member[4]} - <a href="{member[1]}">{member[0]}</a> ({member[3]})\n' for member in other_member_data_list],
])


button_text_member_list : dict[str, tuple[str, str]] = {
    "ru": ("Состав 👥", "mbr_lst"),
    "en": ("Members 👥", "mbr_lst"),
}
button_text_links : dict[str, tuple[str, str]] = {
    "ru": ("Ссылки 🔗", "sc_lnks"),
    "en": ("Links 🔗", "sc_lnks"),
}
