block_enter_text = "Мы очень рады, что вы хотите присоединиться к нам!\n\n"\
                   "Для этого напиши заяку в формате:\n"\
                   "```\n"\
                   "ФИО:\n"\
                   "Желаемая должность:\n\n"\
                   "Курс:\n"\
                   "Программа:\n"\
                   "О себе:\n"\
                   "```\n"
block_default_text = "Мы примим заявку в следующем виде:"

reqest_registred_text = "Спасибо за вашу заявку!"

unknown_user = "Errror: user is unknown"
