chat_id_text = "ID твоего чата: {0}"
bot_id_text = "ID бота: {0}"
fsm_state_text = "Твой state: {0}\nТвои данные: {1}"

facts_format_text = "Интересный факт №{0}:\n\n"

facts_text = [
    "Ты нашёл секретный факт!\n\nТвой код: {0}",
    "Самым сложным при создании бота было не написание кода и не создание его структуры, а написание описания Студсовета 😁",
    "Для того, чтобы улучшить свои оценки нужно просто принести на экзамен ..... себя с выученным материалом",
    "Изначально эта секция не планировалась, но разрабу показалось, что это привлечёт людей =)",
    "??? Если прописать эту команду 19 числа ровно в 04:04, то можно получить секретный код, но зачем он нужен... ???",
    "Изначально над ботом работал только один человек. Сейчас над ним работает пол команды Студсовета, начиная от комитета Event-менеджмента и PR, заканчивая SMM-отделом",
    "Изначально в Студсовет было избрано 24 делегатов, но со временем их количество сократилось до 17, зато появилось очень много волонтеров 😊",
    "В боте есть баг, но разработчик его не нашел 😈",
    "В боте есть дополнительный функционал, но он доступен не всем.",
    "Файл с этими фактами доступен на GitHub и его можно попробовать найти, чтобы не перебирать все факты =]",
    "Мы планируем написать ещё одного бота, но зачем он будет нужен, вы узнаете позже =)",
    "В апреле мы планируем запустить криптовалюту, но вам об этом не расскажем =D",
    "Мы так и не определились с картинками =D",
]

credits_text = """Участвовали в запуске бота:

• Архипов Данил - идея создания проекта | разработка архитектуры | решение административных вопросов
• Александр Серков - написание кода | разработка архитектуры
• Горшков Максим - поиск и организация хостинга | установление партнёрских связей с Selectel | тестирование и запуск бота | информационное сопровождение
• Матвеев Анатолий - шикарный дизайн

Отдельное спасибо Selectel за предоставленный хостинг и всем, кто поддерживал проект, занимался его тестипрованием и предлагал идеи!"""
