block_enter_text: dict[str, str] = {
    "ru": """😞В данный момент, к сожалению, набор в состав Студсовета не проводится. Если вы хотите стать делегатом и получить мандат на принятие важных решений в жизни НИУ ВШЭ — подавайтесь на ежегодные октябрьские выборы, о которых мы обязательно вам сообщим!

Волонтёры Студсовета помогают в решении важных вопросов в зависимости от комитета — аналитика, проведение крупных мероприятий, разработка собственных программ обучения, ведение социальных сетей и многое другое. Обычно набор волонтёров проводят в августе, ноябре и апреле. Встурай в наши соцсети и stay tuned!🔔""",
    "en": """😞Unfortunately, at this moment we aren't accepting applications. If you'd like to become a delegate (representative мне нравится больше, но это уже на ваше усмотрение) and participate in making important decisions, you can apply for the annual elections, which are held in October.

Student Council's volunteers help us with all kinds of tasks: from maintaining our social networks to organising events. Usually, we accept applications for volunteering positions in August, November and April.""",
}

# block_enter_text = "Мы очень рады, что вы хотите присоединиться к нам!\n\n"\
#                    "Для этого напиши заяку в формате:\n"\
#                    "```\n"\
#                    "ФИО:\n"\
#                    "Желаемая должность:\n\n"\
#                    "Курс:\n"\
#                    "Программа:\n"\
#                    "О себе:\n"\
#                    "```\n"
